# Data Cleaning Pandas Assignment

Problem Statement

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis? Take this monstrosity as the DataFrame to use in the following puzzles:

In [24]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
 
'Budapest_PaRis', 'Brussels_londOn'], 
 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
 
'12. Air France', '"Swiss Air"']})

1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [25]:
df1=np.where(df["FlightNumber"].isnull()==True)
for i in df1:
    df["FlightNumber"][i]=0
df["FlightNumber"]=df["FlightNumber"]+10
df["FlightNumber"]=df["FlightNumber"].astype(int)
df

C:\Users\Spark\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10055      [23, 47]               KLM(!)
1      MAdrid_miLAN            10            []    <Air France> (12)
2  londON_StockhOlm         10075  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis            10          [13]       12. Air France
4   Brussels_londOn         10095      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [26]:
renamed_col=["From","To"]

From_To=pd.DataFrame([p.split('_') for p in df["From_To"]])
From_To.columns=renamed_col

From_To

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [27]:
From_To["From"]=From_To["From"].str.title()
From_To["To"]=From_To["To"].str.title()
From_To

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions

In [28]:
del df["From_To"]
df=pd.concat([df,From_To],axis=1)

df

   FlightNumber  RecentDelays              Airline      From         To
0         10055      [23, 47]               KLM(!)    London      Paris
1            10            []    <Air France> (12)    Madrid      Milan
2         10075  [24, 43, 87]  (British Airways. )    London  Stockholm
3            10          [13]       12. Air France  Budapest      Paris
4         10095      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.          Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [29]:
length=max([len(i) for i in df["RecentDelays"]])+1
new_col=["delay_"+str(p) for p in range(1,length)]

delay=pd.DataFrame(q for q in df["RecentDelays"])
delay.columns=new_col

df=pd.concat([df,delay],axis=1)
del df["RecentDelays"]

df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10055,KLM(!),London,Paris,23.0,47.0,NaN
1,10,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10075,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10095,"""Swiss Air""",Brussels,London,67.0,32.0,NaN